class Setting:
    """
    各种预设属性
    """
    screenWidth = 3840
    screenHeight = 2160

    # 屏幕缩放系数
    scaleFactor = 1

    # 键为页面名，值为页面特征文字
    textdictReco = {
        "主界面": "战役推进",
        "班组": "要务",
        "商城": "认购合约",
        "整备室": "云图强固",
        "智能导航光屏": "智能导航光屏",
        "公共区": "调度室",
        "调度室": "调度收益",
        "情报储备": "情报储备情况",
        "资源生产": "每小时产量",
        "班组补给": "班组领取记录",
        "班组要务": "每日要务",
        "设置": "设置",
        "登录": "点击开始",
        "演习": "布设防御",
        "限时开启": "定期参与活动可获得丰厚报酬"
    }

    # 储存ocr结果，0为位置，1为文本，2为置信度
    listResults = []

    # 初始化窗口
    hwnd = None  # 窗口句柄
    windowPosition = None  # 窗口位置
    windowBar = None  # 窗口是否有标题栏
    titleBarHeight = 58  # 标题栏高度

    # 识别置信度阈值
    threshold = 0.8
